{
  "name": "Scenario C: Rejection (Beyond Economical Repair)",
  "description": "Class IIb patient monitor with extensive water damage — rejected at quote stage as beyond economical repair, 3 actions",
  "expectedRiskCategory": "routine",
  "expectedEstimatedCost": 6000,
  "expectedPath": [1, 2, 3],
  "skipsRegulatoryReview": null,
  "expectedRejection": true,
  "rejectionAction": 3,
  "rejectionReason": "Device assessed as Beyond Economical Repair (BER). Extensive water ingress damage has caused corrosion across multiple PCB assemblies including the power supply, signal processing, and display driver boards. Estimated repair cost (£6,000+) exceeds 70% of replacement cost (£8,200). Three critical ICs are discontinued with no compatible substitutes. Recommend decommissioning and replacement. Manufacturer (GE Healthcare) has confirmed end-of-life for this model — no spare parts available after Q3 2026.",
  "actions": {
    "1": {
      "deviceName": "GE Carescape B650 Patient Monitor",
      "deviceClass": "Class IIb",
      "manufacturer": "GE Healthcare",
      "serialNumber": "GEC-2018-33104",
      "failureType": "mechanical",
      "failureDescription": "Multiple board-level failures across power supply and signal processing modules. Water ingress damage from flood event in Cardiology Ward basement store. Corrosion visible on internal connectors and PCBs. Device failed to power on after drying period.",
      "department": "Cardiology Ward",
      "complexityFactor": 8,
      "urgency": "routine"
    },
    "2": {
      "budgetApproved": true,
      "budgetCode": "MED-20260091",
      "approvalNotes": "Approved for assessment only. Budget contingent on economical viability of repair. If repair cost exceeds 60% of replacement value, recommend decommissioning. Replacement budget may be available from insurance claim (flood damage)."
    },
    "3": {
      "initialAssessment": "Extensive water damage confirmed. Corrosion present on 4 of 6 PCB assemblies. Power supply board: 3 corroded ICs (2x discontinued, no compatible substitute). Signal processing board: water tracking between layers causing intermittent shorts. Display driver: connector pins corroded beyond recovery. Chassis: internal mounting points show oxidation. Estimated repair would require replacing 4 boards at a cost exceeding device replacement value. Manufacturer confirms end-of-life status with limited parts availability. RECOMMENDATION: Beyond Economical Repair — decommission and replace.",
      "partsRequired": "N/A — device assessed as Beyond Economical Repair (BER)",
      "estimatedDays": 1,
      "jobAccepted": false
    }
  }
}