{
  "name": "Scenario B: High-Risk Commercial",
  "description": "8-storey commercial building (riskScore 22.8) — triggers environmental review, full 6-action path",
  "expectedRiskScore": 22.8,
  "expectedPermitFee": 15250,
  "expectedPath": [1, 2, 3, 4, 5, 6],
  "skipsEnvironmental": false,
  "expectedRejection": false,
  "actions": {
    "1": {
      "projectName": "Central Business Tower",
      "siteAddress": "42 Commerce Street, Riverside, RS2 7GH",
      "buildingType": "commercial",
      "estimatedValue": 5000000,
      "grossFloorArea": 3500,
      "storeys": 8,
      "existingStructure": true
    },
    "2": {
      "loadRating": 8.2,
      "foundationType": "piled",
      "structuralGrade": "A",
      "structuralNotes": "Piled foundations recommended due to 8-storey height and brownfield site conditions. High load-bearing capacity confirmed. Steel frame construction with reinforced concrete core."
    },
    "3": {
      "zoningCompliant": true,
      "planningNotes": "Site is in mixed-use commercial zone CZ-7. 8-storey height approved under tall building policy TB-03. Risk score 22.8 exceeds threshold — routing to environmental assessment. Existing warehouse demolition plan reviewed and approved."
    },
    "4": {
      "environmentalImpact": "medium",
      "mitigationRequired": true,
      "environmentalConditions": "Noise mitigation: construction piling limited to 09:00-17:00. Dust suppression required during demolition phase. Contaminated soil from existing warehouse must be remediated per EA guidelines. Surface water drainage to include SuDS attenuation tank. Ecological survey of adjacent canal corridor required before works commence."
    },
    "5": {
      "structuralApproved": true,
      "fireCompliant": true,
      "accessCompliant": true,
      "inspectionNotes": "Structural plans exceed minimum requirements. Fire strategy includes dual staircase evacuation, sprinkler system throughout, and smoke ventilation in atrium. Accessible lifts to all floors with refuge areas at each level. Environmental conditions from Green Valley Environmental to be incorporated as permit conditions."
    },
    "6": {
      "approved": true,
      "permitNumber": "RBC-2026-00287",
      "validUntil": "2029-02-17",
      "conditions": "Subject to environmental conditions: noise mitigation during piling (09:00-17:00 only), dust suppression during demolition, contaminated soil remediation per EA guidelines, SuDS attenuation tank installation, ecological survey of canal corridor. Construction management plan required before commencement. Party wall agreements with adjacent properties to be completed."
    }
  }
}
